# Задача 10: Словник книг, де ключ — назва книги, а значення — автор.
# Функція, яка повертає всі книги певного автора.

knygy = {
    "Кобзар": "Тарас Шевченко",
    "Тіні забутих предків": "Михайло Коцюбинський",
    "Лісова пісня": "Леся Українка",
    "Земля": "Ольга Кобилянська",
    "Захар Беркут": "Іван Франко",
    "Мойсей": "Іван Франко",
    "Камінний хрест": "Василь Стефаник",
    "Intermezzo": "Михайло Коцюбинський",
    "Mavka": "Леся Українка",
    "Чорна рада": "Пантелеймон Куліш",
}


def knygy_avtora(avtor):
    result = []
    for nazva, a in knygy.items():
        if a == avtor:
            result.append(nazva)
    return result


# Тест
avtory = ["Іван Франко", "Леся Українка", "Михайло Коцюбинський", "Тарас Шевченко"]

for avtor in avtory:
    knyzhky = knygy_avtora(avtor)
    if knyzhky:
        print(f"Книги автора '{avtor}': {knyzhky}")
    else:
        print(f"Книги автора '{avtor}' не знайдено")
